restapi/models/LoginForm.php

    public function login()
    {
        $user = $this->getUser();
        if ($this->validate()) {
            $token = Yii::$app->security->generateRandomString(150);
            $user->access_token = $token;
            return $user->save() ? $token : null;
---
UPDATE `user` SET `access_token`='EBb64f8_eBwqEJIgOx2r4DDm9dzj_LZyQelDHIiyPRzPTLvrVa6o9MFGCnzCyUHUwEjyUgmHFKJskSBhNIh7qMJnW8wPzeggHGsqBpHzA0pUiO_XCJ_HAOuUQlIKS_g2WvkcKylJ5qSKO1ykz5vk83', `updated_at`=1616815607 WHERE `id`=1