common/models/Service.php

INSERT INTO `service` (`category_id`, `price`, `user_id`) VALUES (1, 1, 1)
INSERT INTO `service_translations` (`service_id`, `language`, `value`) VALUES (19, 'en', 'yitkazish')
---
    public function Creates($request)
    {
        $service = new Service();
        $servicetrans = new ServiceTranslations();
        $service->category_id = $this->category_id;
        $service->price = $this->price;
        $service->user_id = Yii::$app->user->identity->id;
        if ($service->save(false)){
            $servicetrans->service_id = $service->id;
            $servicetrans->language = $request->getBodyParam('language');
            $servicetrans->value = $request->getBodyParam('value');
            $servicetrans->save(false);

SELECT * FROM `service` WHERE `id`=5
SELECT * FROM `service_translations` WHERE `id`=5
UPDATE `service_translations` SET `language`='en', `value`='yitkazish' WHERE `id`=5
---
    public function Updates($request)
    {
        $service = Service::findOne($request->getBodyParam('id'));
        $servicetrans = ServiceTranslations::findOne($request->getBodyParam('id'));
        $service->category_id = $request->getBodyParam('category_id');
        $service->price = $request->getBodyParam('price');
        if ($service->save(false)){
            $servicetrans->language = $request->getBodyParam('language');
            $servicetrans->value = $request->getBodyParam('value');
            $servicetrans->save(false);