common/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `user` WHERE `access_token`='O8aiGxXm3x11rYhLSZvgd1lIrdI0OsNSbHJNZcp3d48d0LoOs1FjLucYW0N4HWD_0oglYfTTpXaU0bHcAx4Yfky5Pu913i7tOsa0Sxg7VLZLQaxlMywl302nK9IGFPAPWs-nt-P_jhStqAy8c-q_ww'