restapi/controllers/ServiceController.php

    public function actionIndex(){
        $ervices = Service::find()->all();
---
SELECT * FROM `service`

    public function actionUpdate(){
        $request = $request = Yii::$app->request;
        $model =  Service::findOne($request->getBodyParam('id'));
---
SELECT * FROM `service` WHERE `id` IS NULL

    protected function findModel($id)
    {
        if (($model = Service::findOne($id)) !== null) {
---
SELECT * FROM `service` WHERE `id`='4'